Revit 2026 API

# ComponentRepeaterCanElementBeRepeated Method

---

Determines whether an element can be repeated using the **RepeatElements** method.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CanElementBeRepeated(
	Document ADoc,
	ElementId elementId
)
```
```vb
Public Shared Function CanElementBeRepeated (
	ADoc As Document,
	elementId As ElementId
) As Boolean
```
```cpp
public:
static bool CanElementBeRepeated(
	Document^ ADoc,
	ElementId^ elementId
)
```
```fsharp
static member CanElementBeRepeated :
        ADoc : Document *
        elementId : ElementId -> bool
```

#### Parameters

ADoc Document
     The document containing the element.
elementId ElementId
     The element to be tested.

#### Return Value

Boolean True if the element can be repeated.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The element must be an adaptive family instance and have no shape handles. At least one placement point must be hosted on a 1D or 2D repeating reference. All other placement points can be hosted on a 0D, 1D or 2D repeating reference, or must be unhosted.

#### Reference

ComponentRepeater Class

Autodesk.Revit.DB Namespace